{
  "nodes": [
    {
      "op": "null", 
      "name": "data", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv1_weight", 
      "attr": {
        "kernel": "(1, 7, 7)", 
        "no_bias": "True", 
        "num_filter": "64", 
        "pad": "(0, 3, 3)", 
        "stride": "(1, 2, 2)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "conv1", 
      "attr": {
        "kernel": "(1, 7, 7)", 
        "no_bias": "True", 
        "num_filter": "64", 
        "pad": "(0, 3, 3)", 
        "stride": "(1, 2, 2)"
      }, 
      "inputs": [[0, 0, 0], [1, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "bn_conv1_gamma", 
      "attr": {
        "eps": "1e-05", 
        "fix_gamma": "False"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "bn_conv1_beta", 
      "attr": {
        "eps": "1e-05", 
        "fix_gamma": "False"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "bn_conv1_moving_mean", 
      "attr": {
        "__init__": "[\"zero\", {}]", 
        "eps": "1e-05", 
        "fix_gamma": "False"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "bn_conv1_moving_var", 
      "attr": {
        "__init__": "[\"one\", {}]", 
        "eps": "1e-05", 
        "fix_gamma": "False"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "bn_conv1", 
      "attr": {
        "eps": "1e-05", 
        "fix_gamma": "False"
      }, 
      "inputs": [[2, 0, 0], [3, 0, 0], [4, 0, 0], [5, 0, 1], [6, 0, 1]]
    }, 
    {
      "op": "Activation", 
      "name": "conv1_relu", 
      "attr": {"act_type": "relu"}, 
      "inputs": [[7, 0, 0]]
    }, 
    {
      "op": "Pooling", 
      "name": "pool1", 
      "attr": {
        "kernel": "(2, 3, 3)", 
        "pad": "(0, 0, 0)", 
        "pool_type": "max", 
        "pooling_convention": "full", 
        "stride": "(2, 2, 2)"
      }, 
      "inputs": [[8, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "res2a_branch1_weight", 
      "attr": {
        "kernel": "(1, 1, 1)", 
        "no_bias": "True", 
        "num_filter": "256", 
        "pad": "(0, 0, 0)", 
        "stride": "(1, 1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "res2a_branch1", 
      "attr": {
        "kernel": "(1, 1, 1)", 
        "no_bias": "True", 
        "num_filter": "256", 
        "pad": "(0, 0, 0)", 
        "stride": "(1, 1, 1)"
      }, 
      "inputs": [[9, 0, 0], [10, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "bn2a_branch1_gamma", 
      "attr": {
        "eps": "1e-05", 
        "fix_gamma": "False"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "bn2a_branch1_beta", 
      "attr": {
        "eps": "1e-05", 
        "fix_gamma": "False"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "bn2a_branch1_moving_mean", 
      "attr": {
        "__init__": "[\"zero\", {}]", 
        "eps": "1e-05", 
        "fix_gamma": "False"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "bn2a_branch1_moving_var", 
      "attr": {
        "__init__": "[\"one\", {}]", 
        "eps": "1e-05", 
        "fix_gamma": "False"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "bn2a_branch1", 
      "attr": {
        "eps": "1e-05", 
        "fix_gamma": "False"
      }, 
      "inputs": [[11, 0, 0], [12, 0, 0], [13, 0, 0], [14, 0, 1], [15, 0, 1]]
    }, 
    {
      "op": "null", 
      "name": "res2a_branch2a_weight", 
      "attr": {
        "kernel": "(1, 1, 1)", 
        "no_bias": "True", 
        "num_filter": "64", 
        "pad": "(0, 0, 0)", 
        "stride": "(1, 1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "res2a_branch2a", 
      "attr": {
        "kernel": "(1, 1, 1)", 
        "no_bias": "True", 
        "num_filter": "64", 
        "pad": "(0, 0, 0)", 
        "stride": "(1, 1, 1)"
      }, 
      "inputs": [[9, 0, 0], [17, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "bn2a_branch2a_gamma", 
      "attr": {
        "eps": "1e-05", 
        "fix_gamma": "False"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "bn2a_branch2a_beta", 
      "attr": {
        "eps": "1e-05", 
        "fix_gamma": "False"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "bn2a_branch2a_moving_mean", 
      "attr": {
        "__init__": "[\"zero\", {}]", 
        "eps": "1e-05", 
        "fix_gamma": "False"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "bn2a_branch2a_moving_var", 
      "attr": {
        "__init__": "[\"one\", {}]", 
        "eps": "1e-05", 
        "fix_gamma": "False"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "bn2a_branch2a", 
      "attr": {
        "eps": "1e-05", 
        "fix_gamma": "False"
      }, 
      "inputs": [[18, 0, 0], [19, 0, 0], [20, 0, 0], [21, 0, 1], [22, 0, 1]]
    }, 
    {
      "op": "Activation", 
      "name": "res2a_branch2a_relu", 
      "attr": {"act_type": "relu"}, 
      "inputs": [[23, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "res2a_branch2b_weight", 
      "attr": {
        "kernel": "(1, 3, 3)", 
        "no_bias": "True", 
        "num_filter": "64", 
        "pad": "(0, 1, 1)", 
        "stride": "(1, 1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "res2a_branch2b", 
      "attr": {
        "kernel": "(1, 3, 3)", 
        "no_bias": "True", 
        "num_filter": "64", 
        "pad": "(0, 1, 1)", 
        "stride": "(1, 1, 1)"
      }, 
      "inputs": [[24, 0, 0], [25, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "bn2a_branch2b_gamma", 
      "attr": {
        "eps": "1e-05", 
        "fix_gamma": "False"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "bn2a_branch2b_beta", 
      "attr": {
        "eps": "1e-05", 
        "fix_gamma": "False"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "bn2a_branch2b_moving_mean", 
      "attr": {
        "__init__": "[\"zero\", {}]", 
        "eps": "1e-05", 
        "fix_gamma": "False"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "bn2a_branch2b_moving_var", 
      "attr": {
        "__init__": "[\"one\", {}]", 
        "eps": "1e-05", 
        "fix_gamma": "False"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "bn2a_branch2b", 
      "attr": {
        "eps": "1e-05", 
        "fix_gamma": "False"
      }, 
      "inputs": [[26, 0, 0], [27, 0, 0], [28, 0, 0], [29, 0, 1], [30, 0, 1]]
    }, 
    {
      "op": "Activation", 
      "name": "res2a_branch2b_relu", 
      "attr": {"act_type": "relu"}, 
      "inputs": [[31, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "res2a_branch2b_t_weight", 
      "attr": {
        "kernel": "(3, 1, 1)", 
        "no_bias": "True", 
        "num_filter": "64", 
        "pad": "(1, 0, 0)", 
        "stride": "(1, 1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "res2a_branch2b_t", 
      "attr": {
        "kernel": "(3, 1, 1)", 
        "no_bias": "True", 
        "num_filter": "64", 
        "pad": "(1, 0, 0)", 
        "stride": "(1, 1, 1)"
      }, 
      "inputs": [[32, 0, 0], [33, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "bn2a_branch2b_t_gamma", 
      "attr": {
        "eps": "1e-05", 
        "fix_gamma": "False"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "bn2a_branch2b_t_beta", 
      "attr": {
        "eps": "1e-05", 
        "fix_gamma": "False"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "bn2a_branch2b_t_moving_mean", 
      "attr": {
        "__init__": "[\"zero\", {}]", 
        "eps": "1e-05", 
        "fix_gamma": "False"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "bn2a_branch2b_t_moving_var", 
      "attr": {
        "__init__": "[\"one\", {}]", 
        "eps": "1e-05", 
        "fix_gamma": "False"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "bn2a_branch2b_t", 
      "attr": {
        "eps": "1e-05", 
        "fix_gamma": "False"
      }, 
      "inputs": [[34, 0, 0], [35, 0, 0], [36, 0, 0], [37, 0, 1], [38, 0, 1]]
    }, 
    {
      "op": "Activation", 
      "name": "res2a_branch2b_t_relu", 
      "attr": {"act_type": "relu"}, 
      "inputs": [[39, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "res2a_branch2c_weight", 
      "attr": {
        "kernel": "(1, 1, 1)", 
        "no_bias": "True", 
        "num_filter": "256", 
        "pad": "(0, 0, 0)", 
        "stride": "(1, 1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "res2a_branch2c", 
      "attr": {
        "kernel": "(1, 1, 1)", 
        "no_bias": "True", 
        "num_filter": "256", 
        "pad": "(0, 0, 0)", 
        "stride": "(1, 1, 1)"
      }, 
      "inputs": [[40, 0, 0], [41, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "bn2a_branch2c_gamma", 
      "attr": {
        "eps": "1e-05", 
        "fix_gamma": "False"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "bn2a_branch2c_beta", 
      "attr": {
        "eps": "1e-05", 
        "fix_gamma": "False"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "bn2a_branch2c_moving_mean", 
      "attr": {
        "__init__": "[\"zero\", {}]", 
        "eps": "1e-05", 
        "fix_gamma": "False"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "bn2a_branch2c_moving_var", 
      "attr": {
        "__init__": "[\"one\", {}]", 
        "eps": "1e-05", 
        "fix_gamma": "False"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "bn2a_branch2c", 
      "attr": {
        "eps": "1e-05", 
        "fix_gamma": "False"
      }, 
      "inputs": [[42, 0, 0], [43, 0, 0], [44, 0, 0], [45, 0, 1], [46, 0, 1]]
    }, 
    {
      "op": "broadcast_add", 
      "name": "res2a", 
      "inputs": [[16, 0, 0], [47, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "res2a_relu", 
      "attr": {"act_type": "relu"}, 
      "inputs": [[48, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "res2b_branch2a_weight", 
      "attr": {
        "kernel": "(1, 1, 1)", 
        "no_bias": "True", 
        "num_filter": "64", 
        "pad": "(0, 0, 0)", 
        "stride": "(1, 1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "res2b_branch2a", 
      "attr": {
        "kernel": "(1, 1, 1)", 
        "no_bias": "True", 
        "num_filter": "64", 
        "pad": "(0, 0, 0)", 
        "stride": "(1, 1, 1)"
      }, 
      "inputs": [[49, 0, 0], [50, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "bn2b_branch2a_gamma", 
      "attr": {
        "eps": "1e-05", 
        "fix_gamma": "False"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "bn2b_branch2a_beta", 
      "attr": {
        "eps": "1e-05", 
        "fix_gamma": "False"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "bn2b_branch2a_moving_mean", 
      "attr": {
        "__init__": "[\"zero\", {}]", 
        "eps": "1e-05", 
        "fix_gamma": "False"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "bn2b_branch2a_moving_var", 
      "attr": {
        "__init__": "[\"one\", {}]", 
        "eps": "1e-05", 
        "fix_gamma": "False"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "bn2b_branch2a", 
      "attr": {
        "eps": "1e-05", 
        "fix_gamma": "False"
      }, 
      "inputs": [[51, 0, 0], [52, 0, 0], [53, 0, 0], [54, 0, 1], [55, 0, 1]]
    }, 
    {
      "op": "Activation", 
      "name": "res2b_branch2a_relu", 
      "attr": {"act_type": "relu"}, 
      "inputs": [[56, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "res2b_branch2b_weight", 
      "attr": {
        "kernel": "(1, 3, 3)", 
        "no_bias": "True", 
        "num_filter": "64", 
        "pad": "(0, 1, 1)", 
        "stride": "(1, 1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "res2b_branch2b", 
      "attr": {
        "kernel": "(1, 3, 3)", 
        "no_bias": "True", 
        "num_filter": "64", 
        "pad": "(0, 1, 1)", 
        "stride": "(1, 1, 1)"
      }, 
      "inputs": [[57, 0, 0], [58, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "bn2b_branch2b_gamma", 
      "attr": {
        "eps": "1e-05", 
        "fix_gamma": "False"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "bn2b_branch2b_beta", 
      "attr": {
        "eps": "1e-05", 
        "fix_gamma": "False"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "bn2b_branch2b_moving_mean", 
      "attr": {
        "__init__": "[\"zero\", {}]", 
        "eps": "1e-05", 
        "fix_gamma": "False"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "bn2b_branch2b_moving_var", 
      "attr": {
        "__init__": "[\"one\", {}]", 
        "eps": "1e-05", 
        "fix_gamma": "False"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "bn2b_branch2b", 
      "attr": {
        "eps": "1e-05", 
        "fix_gamma": "False"
      }, 
      "inputs": [[59, 0, 0], [60, 0, 0], [61, 0, 0], [62, 0, 1], [63, 0, 1]]
    }, 
    {
      "op": "Activation", 
      "name": "res2b_branch2b_relu", 
      "attr": {"act_type": "relu"}, 
      "inputs": [[64, 0, 0]]
    }, 
    {
      "op": "_mul_scalar", 
      "name": "_mulscalar0", 
      "attr": {"scalar": "1.0"}, 
      "inputs": [[65, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "res2b_branch2b_t_weight", 
      "attr": {
        "kernel": "(3, 1, 1)", 
        "no_bias": "True", 
        "num_filter": "64", 
        "pad": "(1, 0, 0)", 
        "stride": "(1, 1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "res2b_branch2b_t", 
      "attr": {
        "kernel": "(3, 1, 1)", 
        "no_bias": "True", 
        "num_filter": "64", 
        "pad": "(1, 0, 0)", 
        "stride": "(1, 1, 1)"
      }, 
      "inputs": [[57, 0, 0], [67, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "bn2b_branch2b_t_gamma", 
      "attr": {
        "eps": "1e-05", 
        "fix_gamma": "False"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "bn2b_branch2b_t_beta", 
      "attr": {
        "eps": "1e-05", 
        "fix_gamma": "False"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "bn2b_branch2b_t_moving_mean", 
      "attr": {
        "__init__": "[\"zero\", {}]", 
        "eps": "1e-05", 
        "fix_gamma": "False"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "bn2b_branch2b_t_moving_var", 
      "attr": {
        "__init__": "[\"one\", {}]", 
        "eps": "1e-05", 
        "fix_gamma": "False"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "bn2b_branch2b_t", 
      "attr": {
        "eps": "1e-05", 
        "fix_gamma": "False"
      }, 
      "inputs": [[68, 0, 0], [69, 0, 0], [70, 0, 0], [71, 0, 1], [72, 0, 1]]
    }, 
    {
      "op": "_mul_scalar", 
      "name": "_mulscalar1", 
      "attr": {"scalar": "1.0"}, 
      "inputs": [[73, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus0", 
      "inputs": [[66, 0, 0], [74, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "res2b_branch2b_st_relu", 
      "attr": {"act_type": "relu"}, 
      "inputs": [[75, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "res2b_branch2c_weight", 
      "attr": {
        "kernel": "(1, 1, 1)", 
        "no_bias": "True", 
        "num_filter": "256", 
        "pad": "(0, 0, 0)", 
        "stride": "(1, 1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "res2b_branch2c", 
      "attr": {
        "kernel": "(1, 1, 1)", 
        "no_bias": "True", 
        "num_filter": "256", 
        "pad": "(0, 0, 0)", 
        "stride": "(1, 1, 1)"
      }, 
      "inputs": [[76, 0, 0], [77, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "bn2b_branch2c_gamma", 
      "attr": {
        "eps": "1e-05", 
        "fix_gamma": "False"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "bn2b_branch2c_beta", 
      "attr": {
        "eps": "1e-05", 
        "fix_gamma": "False"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "bn2b_branch2c_moving_mean", 
      "attr": {
        "__init__": "[\"zero\", {}]", 
        "eps": "1e-05", 
        "fix_gamma": "False"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "bn2b_branch2c_moving_var", 
      "attr": {
        "__init__": "[\"one\", {}]", 
        "eps": "1e-05", 
        "fix_gamma": "False"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "bn2b_branch2c", 
      "attr": {
        "eps": "1e-05", 
        "fix_gamma": "False"
      }, 
      "inputs": [[78, 0, 0], [79, 0, 0], [80, 0, 0], [81, 0, 1], [82, 0, 1]]
    }, 
    {
      "op": "broadcast_add", 
      "name": "res2b", 
      "inputs": [[49, 0, 0], [83, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "res2b_relu", 
      "attr": {"act_type": "relu"}, 
      "inputs": [[84, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "res2c_branch2a_weight", 
      "attr": {
        "kernel": "(1, 1, 1)", 
        "no_bias": "True", 
        "num_filter": "64", 
        "pad": "(0, 0, 0)", 
        "stride": "(1, 1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "res2c_branch2a", 
      "attr": {
        "kernel": "(1, 1, 1)", 
        "no_bias": "True", 
        "num_filter": "64", 
        "pad": "(0, 0, 0)", 
        "stride": "(1, 1, 1)"
      }, 
      "inputs": [[85, 0, 0], [86, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "bn2c_branch2a_gamma", 
      "attr": {
        "eps": "1e-05", 
        "fix_gamma": "False"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "bn2c_branch2a_beta", 
      "attr": {
        "eps": "1e-05", 
        "fix_gamma": "False"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "bn2c_branch2a_moving_mean", 
      "attr": {
        "__init__": "[\"zero\", {}]", 
        "eps": "1e-05", 
        "fix_gamma": "False"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "bn2c_branch2a_moving_var", 
      "attr": {
        "__init__": "[\"one\", {}]", 
        "eps": "1e-05", 
        "fix_gamma": "False"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "bn2c_branch2a", 
      "attr": {
        "eps": "1e-05", 
        "fix_gamma": "False"
      }, 
      "inputs": [[87, 0, 0], [88, 0, 0], [89, 0, 0], [90, 0, 1], [91, 0, 1]]
    }, 
    {
      "op": "Activation", 
      "name": "res2c_branch2a_relu", 
      "attr": {"act_type": "relu"}, 
      "inputs": [[92, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "res2c_branch2b_weight", 
      "attr": {
        "kernel": "(1, 3, 3)", 
        "no_bias": "True", 
        "num_filter": "64", 
        "pad": "(0, 1, 1)", 
        "stride": "(1, 1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "res2c_branch2b", 
      "attr": {
        "kernel": "(1, 3, 3)", 
        "no_bias": "True", 
        "num_filter": "64", 
        "pad": "(0, 1, 1)", 
        "stride": "(1, 1, 1)"
      }, 
      "inputs": [[93, 0, 0], [94, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "bn2c_branch2b_gamma", 
      "attr": {
        "eps": "1e-05", 
        "fix_gamma": "False"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "bn2c_branch2b_beta", 
      "attr": {
        "eps": "1e-05", 
        "fix_gamma": "False"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "bn2c_branch2b_moving_mean", 
      "attr": {
        "__init__": "[\"zero\", {}]", 
        "eps": "1e-05", 
        "fix_gamma": "False"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "bn2c_branch2b_moving_var", 
      "attr": {
        "__init__": "[\"one\", {}]", 
        "eps": "1e-05", 
        "fix_gamma": "False"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "bn2c_branch2b", 
      "attr": {
        "eps": "1e-05", 
        "fix_gamma": "False"
      }, 
      "inputs": [[95, 0, 0], [96, 0, 0], [97, 0, 0], [98, 0, 1], [99, 0, 1]]
    }, 
    {
      "op": "Activation", 
      "name": "res2c_branch2b_relu", 
      "attr": {"act_type": "relu"}, 
      "inputs": [[100, 0, 0]]
    }, 
    {
      "op": "_mul_scalar", 
      "name": "_mulscalar2", 
      "attr": {"scalar": "0.5"}, 
      "inputs": [[101, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "res2c_branch2b_t_weight", 
      "attr": {
        "kernel": "(3, 1, 1)", 
        "no_bias": "True", 
        "num_filter": "64", 
        "pad": "(1, 0, 0)", 
        "stride": "(1, 1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "res2c_branch2b_t", 
      "attr": {
        "kernel": "(3, 1, 1)", 
        "no_bias": "True", 
        "num_filter": "64", 
        "pad": "(1, 0, 0)", 
        "stride": "(1, 1, 1)"
      }, 
      "inputs": [[101, 0, 0], [103, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "bn2c_branch2b_t_gamma", 
      "attr": {
        "eps": "1e-05", 
        "fix_gamma": "False"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "bn2c_branch2b_t_beta", 
      "attr": {
        "eps": "1e-05", 
        "fix_gamma": "False"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "bn2c_branch2b_t_moving_mean", 
      "attr": {
        "__init__": "[\"zero\", {}]", 
        "eps": "1e-05", 
        "fix_gamma": "False"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "bn2c_branch2b_t_moving_var", 
      "attr": {
        "__init__": "[\"one\", {}]", 
        "eps": "1e-05", 
        "fix_gamma": "False"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "bn2c_branch2b_t", 
      "attr": {
        "eps": "1e-05", 
        "fix_gamma": "False"
      }, 
      "inputs": [[104, 0, 0], [105, 0, 0], [106, 0, 0], [107, 0, 1], [108, 0, 1]]
    }, 
    {
      "op": "_mul_scalar", 
      "name": "_mulscalar3", 
      "attr": {"scalar": "0.5"}, 
      "inputs": [[109, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus1", 
      "inputs": [[102, 0, 0], [110, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "res2c_branch2b_st_relu", 
      "attr": {"act_type": "relu"}, 
      "inputs": [[111, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "res2c_branch2c_weight", 
      "attr": {
        "kernel": "(1, 1, 1)", 
        "no_bias": "True", 
        "num_filter": "256", 
        "pad": "(0, 0, 0)", 
        "stride": "(1, 1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "res2c_branch2c", 
      "attr": {
        "kernel": "(1, 1, 1)", 
        "no_bias": "True", 
        "num_filter": "256", 
        "pad": "(0, 0, 0)", 
        "stride": "(1, 1, 1)"
      }, 
      "inputs": [[112, 0, 0], [113, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "bn2c_branch2c_gamma", 
      "attr": {
        "eps": "1e-05", 
        "fix_gamma": "False"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "bn2c_branch2c_beta", 
      "attr": {
        "eps": "1e-05", 
        "fix_gamma": "False"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "bn2c_branch2c_moving_mean", 
      "attr": {
        "__init__": "[\"zero\", {}]", 
        "eps": "1e-05", 
        "fix_gamma": "False"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "bn2c_branch2c_moving_var", 
      "attr": {
        "__init__": "[\"one\", {}]", 
        "eps": "1e-05", 
        "fix_gamma": "False"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "bn2c_branch2c", 
      "attr": {
        "eps": "1e-05", 
        "fix_gamma": "False"
      }, 
      "inputs": [[114, 0, 0], [115, 0, 0], [116, 0, 0], [117, 0, 1], [118, 0, 1]]
    }, 
    {
      "op": "broadcast_add", 
      "name": "res2c", 
      "inputs": [[85, 0, 0], [119, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "res2c_relu", 
      "attr": {"act_type": "relu"}, 
      "inputs": [[120, 0, 0]]
    }, 
    {
      "op": "Pooling", 
      "name": "_3a_pool", 
      "attr": {
        "kernel": "(2, 1, 1)", 
        "pad": "(0, 0, 0)", 
        "pool_type": "max", 
        "pooling_convention": "full", 
        "stride": "(2, 1, 1)"
      }, 
      "inputs": [[121, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "res3a_branch1_weight", 
      "attr": {
        "kernel": "(1, 1, 1)", 
        "no_bias": "True", 
        "num_filter": "512", 
        "pad": "(0, 0, 0)", 
        "stride": "(1, 2, 2)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "res3a_branch1", 
      "attr": {
        "kernel": "(1, 1, 1)", 
        "no_bias": "True", 
        "num_filter": "512", 
        "pad": "(0, 0, 0)", 
        "stride": "(1, 2, 2)"
      }, 
      "inputs": [[122, 0, 0], [123, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "bn3a_branch1_gamma", 
      "attr": {
        "eps": "1e-05", 
        "fix_gamma": "False"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "bn3a_branch1_beta", 
      "attr": {
        "eps": "1e-05", 
        "fix_gamma": "False"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "bn3a_branch1_moving_mean", 
      "attr": {
        "__init__": "[\"zero\", {}]", 
        "eps": "1e-05", 
        "fix_gamma": "False"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "bn3a_branch1_moving_var", 
      "attr": {
        "__init__": "[\"one\", {}]", 
        "eps": "1e-05", 
        "fix_gamma": "False"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "bn3a_branch1", 
      "attr": {
        "eps": "1e-05", 
        "fix_gamma": "False"
      }, 
      "inputs": [[124, 0, 0], [125, 0, 0], [126, 0, 0], [127, 0, 1], [128, 0, 1]]
    }, 
    {
      "op": "null", 
      "name": "res3a_branch2a_weight", 
      "attr": {
        "kernel": "(1, 1, 1)", 
        "no_bias": "True", 
        "num_filter": "128", 
        "pad": "(0, 0, 0)", 
        "stride": "(1, 2, 2)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "res3a_branch2a", 
      "attr": {
        "kernel": "(1, 1, 1)", 
        "no_bias": "True", 
        "num_filter": "128", 
        "pad": "(0, 0, 0)", 
        "stride": "(1, 2, 2)"
      }, 
      "inputs": [[122, 0, 0], [130, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "bn3a_branch2a_gamma", 
      "attr": {
        "eps": "1e-05", 
        "fix_gamma": "False"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "bn3a_branch2a_beta", 
      "attr": {
        "eps": "1e-05", 
        "fix_gamma": "False"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "bn3a_branch2a_moving_mean", 
      "attr": {
        "__init__": "[\"zero\", {}]", 
        "eps": "1e-05", 
        "fix_gamma": "False"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "bn3a_branch2a_moving_var", 
      "attr": {
        "__init__": "[\"one\", {}]", 
        "eps": "1e-05", 
        "fix_gamma": "False"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "bn3a_branch2a", 
      "attr": {
        "eps": "1e-05", 
        "fix_gamma": "False"
      }, 
      "inputs": [[131, 0, 0], [132, 0, 0], [133, 0, 0], [134, 0, 1], [135, 0, 1]]
    }, 
    {
      "op": "Activation", 
      "name": "res3a_branch2a_relu", 
      "attr": {"act_type": "relu"}, 
      "inputs": [[136, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "res3a_branch2b_weight", 
      "attr": {
        "kernel": "(1, 3, 3)", 
        "no_bias": "True", 
        "num_filter": "128", 
        "pad": "(0, 1, 1)", 
        "stride": "(1, 1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "res3a_branch2b", 
      "attr": {
        "kernel": "(1, 3, 3)", 
        "no_bias": "True", 
        "num_filter": "128", 
        "pad": "(0, 1, 1)", 
        "stride": "(1, 1, 1)"
      }, 
      "inputs": [[137, 0, 0], [138, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "bn3a_branch2b_gamma", 
      "attr": {
        "eps": "1e-05", 
        "fix_gamma": "False"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "bn3a_branch2b_beta", 
      "attr": {
        "eps": "1e-05", 
        "fix_gamma": "False"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "bn3a_branch2b_moving_mean", 
      "attr": {
        "__init__": "[\"zero\", {}]", 
        "eps": "1e-05", 
        "fix_gamma": "False"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "bn3a_branch2b_moving_var", 
      "attr": {
        "__init__": "[\"one\", {}]", 
        "eps": "1e-05", 
        "fix_gamma": "False"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "bn3a_branch2b", 
      "attr": {
        "eps": "1e-05", 
        "fix_gamma": "False"
      }, 
      "inputs": [[139, 0, 0], [140, 0, 0], [141, 0, 0], [142, 0, 1], [143, 0, 1]]
    }, 
    {
      "op": "Activation", 
      "name": "res3a_branch2b_relu", 
      "attr": {"act_type": "relu"}, 
      "inputs": [[144, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "res3a_branch2b_t_weight", 
      "attr": {
        "kernel": "(3, 1, 1)", 
        "no_bias": "True", 
        "num_filter": "128", 
        "pad": "(1, 0, 0)", 
        "stride": "(1, 1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "res3a_branch2b_t", 
      "attr": {
        "kernel": "(3, 1, 1)", 
        "no_bias": "True", 
        "num_filter": "128", 
        "pad": "(1, 0, 0)", 
        "stride": "(1, 1, 1)"
      }, 
      "inputs": [[145, 0, 0], [146, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "bn3a_branch2b_t_gamma", 
      "attr": {
        "eps": "1e-05", 
        "fix_gamma": "False"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "bn3a_branch2b_t_beta", 
      "attr": {
        "eps": "1e-05", 
        "fix_gamma": "False"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "bn3a_branch2b_t_moving_mean", 
      "attr": {
        "__init__": "[\"zero\", {}]", 
        "eps": "1e-05", 
        "fix_gamma": "False"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "bn3a_branch2b_t_moving_var", 
      "attr": {
        "__init__": "[\"one\", {}]", 
        "eps": "1e-05", 
        "fix_gamma": "False"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "bn3a_branch2b_t", 
      "attr": {
        "eps": "1e-05", 
        "fix_gamma": "False"
      }, 
      "inputs": [[147, 0, 0], [148, 0, 0], [149, 0, 0], [150, 0, 1], [151, 0, 1]]
    }, 
    {
      "op": "Activation", 
      "name": "res3a_branch2b_t_relu", 
      "attr": {"act_type": "relu"}, 
      "inputs": [[152, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "res3a_branch2c_weight", 
      "attr": {
        "kernel": "(1, 1, 1)", 
        "no_bias": "True", 
        "num_filter": "512", 
        "pad": "(0, 0, 0)", 
        "stride": "(1, 1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "res3a_branch2c", 
      "attr": {
        "kernel": "(1, 1, 1)", 
        "no_bias": "True", 
        "num_filter": "512", 
        "pad": "(0, 0, 0)", 
        "stride": "(1, 1, 1)"
      }, 
      "inputs": [[153, 0, 0], [154, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "bn3a_branch2c_gamma", 
      "attr": {
        "eps": "1e-05", 
        "fix_gamma": "False"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "bn3a_branch2c_beta", 
      "attr": {
        "eps": "1e-05", 
        "fix_gamma": "False"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "bn3a_branch2c_moving_mean", 
      "attr": {
        "__init__": "[\"zero\", {}]", 
        "eps": "1e-05", 
        "fix_gamma": "False"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "bn3a_branch2c_moving_var", 
      "attr": {
        "__init__": "[\"one\", {}]", 
        "eps": "1e-05", 
        "fix_gamma": "False"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "bn3a_branch2c", 
      "attr": {
        "eps": "1e-05", 
        "fix_gamma": "False"
      }, 
      "inputs": [[155, 0, 0], [156, 0, 0], [157, 0, 0], [158, 0, 1], [159, 0, 1]]
    }, 
    {
      "op": "broadcast_add", 
      "name": "res3a", 
      "inputs": [[129, 0, 0], [160, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "res3a_relu", 
      "attr": {"act_type": "relu"}, 
      "inputs": [[161, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "res3b1_branch2a_weight", 
      "attr": {
        "kernel": "(1, 1, 1)", 
        "no_bias": "True", 
        "num_filter": "128", 
        "pad": "(0, 0, 0)", 
        "stride": "(1, 1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "res3b1_branch2a", 
      "attr": {
        "kernel": "(1, 1, 1)", 
        "no_bias": "True", 
        "num_filter": "128", 
        "pad": "(0, 0, 0)", 
        "stride": "(1, 1, 1)"
      }, 
      "inputs": [[162, 0, 0], [163, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "bn3b1_branch2a_gamma", 
      "attr": {
        "eps": "1e-05", 
        "fix_gamma": "False"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "bn3b1_branch2a_beta", 
      "attr": {
        "eps": "1e-05", 
        "fix_gamma": "False"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "bn3b1_branch2a_moving_mean", 
      "attr": {
        "__init__": "[\"zero\", {}]", 
        "eps": "1e-05", 
        "fix_gamma": "False"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "bn3b1_branch2a_moving_var", 
      "attr": {
        "__init__": "[\"one\", {}]", 
        "eps": "1e-05", 
        "fix_gamma": "False"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "bn3b1_branch2a", 
      "attr": {
        "eps": "1e-05", 
        "fix_gamma": "False"
      }, 
      "inputs": [[164, 0, 0], [165, 0, 0], [166, 0, 0], [167, 0, 1], [168, 0, 1]]
    }, 
    {
      "op": "Activation", 
      "name": "res3b1_branch2a_relu", 
      "attr": {"act_type": "relu"}, 
      "inputs": [[169, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "res3b1_branch2b_weight", 
      "attr": {
        "kernel": "(1, 3, 3)", 
        "no_bias": "True", 
        "num_filter": "128", 
        "pad": "(0, 1, 1)", 
        "stride": "(1, 1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "res3b1_branch2b", 
      "attr": {
        "kernel": "(1, 3, 3)", 
        "no_bias": "True", 
        "num_filter": "128", 
        "pad": "(0, 1, 1)", 
        "stride": "(1, 1, 1)"
      }, 
      "inputs": [[170, 0, 0], [171, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "bn3b1_branch2b_gamma", 
      "attr": {
        "eps": "1e-05", 
        "fix_gamma": "False"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "bn3b1_branch2b_beta", 
      "attr": {
        "eps": "1e-05", 
        "fix_gamma": "False"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "bn3b1_branch2b_moving_mean", 
      "attr": {
        "__init__": "[\"zero\", {}]", 
        "eps": "1e-05", 
        "fix_gamma": "False"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "bn3b1_branch2b_moving_var", 
      "attr": {
        "__init__": "[\"one\", {}]", 
        "eps": "1e-05", 
        "fix_gamma": "False"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "bn3b1_branch2b", 
      "attr": {
        "eps": "1e-05", 
        "fix_gamma": "False"
      }, 
      "inputs": [[172, 0, 0], [173, 0, 0], [174, 0, 0], [175, 0, 1], [176, 0, 1]]
    }, 
    {
      "op": "Activation", 
      "name": "res3b1_branch2b_relu", 
      "attr": {"act_type": "relu"}, 
      "inputs": [[177, 0, 0]]
    }, 
    {
      "op": "_mul_scalar", 
      "name": "_mulscalar4", 
      "attr": {"scalar": "1.0"}, 
      "inputs": [[178, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "res3b1_branch2b_t_weight", 
      "attr": {
        "kernel": "(3, 1, 1)", 
        "no_bias": "True", 
        "num_filter": "128", 
        "pad": "(1, 0, 0)", 
        "stride": "(1, 1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "res3b1_branch2b_t", 
      "attr": {
        "kernel": "(3, 1, 1)", 
        "no_bias": "True", 
        "num_filter": "128", 
        "pad": "(1, 0, 0)", 
        "stride": "(1, 1, 1)"
      }, 
      "inputs": [[170, 0, 0], [180, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "bn3b1_branch2b_t_gamma", 
      "attr": {
        "eps": "1e-05", 
        "fix_gamma": "False"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "bn3b1_branch2b_t_beta", 
      "attr": {
        "eps": "1e-05", 
        "fix_gamma": "False"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "bn3b1_branch2b_t_moving_mean", 
      "attr": {
        "__init__": "[\"zero\", {}]", 
        "eps": "1e-05", 
        "fix_gamma": "False"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "bn3b1_branch2b_t_moving_var", 
      "attr": {
        "__init__": "[\"one\", {}]", 
        "eps": "1e-05", 
        "fix_gamma": "False"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "bn3b1_branch2b_t", 
      "attr": {
        "eps": "1e-05", 
        "fix_gamma": "False"
      }, 
      "inputs": [[181, 0, 0], [182, 0, 0], [183, 0, 0], [184, 0, 1], [185, 0, 1]]
    }, 
    {
      "op": "_mul_scalar", 
      "name": "_mulscalar5", 
      "attr": {"scalar": "1.0"}, 
      "inputs": [[186, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus2", 
      "inputs": [[179, 0, 0], [187, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "res3b1_branch2b_st_relu", 
      "attr": {"act_type": "relu"}, 
      "inputs": [[188, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "res3b1_branch2c_weight", 
      "attr": {
        "kernel": "(1, 1, 1)", 
        "no_bias": "True", 
        "num_filter": "512", 
        "pad": "(0, 0, 0)", 
        "stride": "(1, 1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "res3b1_branch2c", 
      "attr": {
        "kernel": "(1, 1, 1)", 
        "no_bias": "True", 
        "num_filter": "512", 
        "pad": "(0, 0, 0)", 
        "stride": "(1, 1, 1)"
      }, 
      "inputs": [[189, 0, 0], [190, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "bn3b1_branch2c_gamma", 
      "attr": {
        "eps": "1e-05", 
        "fix_gamma": "False"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "bn3b1_branch2c_beta", 
      "attr": {
        "eps": "1e-05", 
        "fix_gamma": "False"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "bn3b1_branch2c_moving_mean", 
      "attr": {
        "__init__": "[\"zero\", {}]", 
        "eps": "1e-05", 
        "fix_gamma": "False"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "bn3b1_branch2c_moving_var", 
      "attr": {
        "__init__": "[\"one\", {}]", 
        "eps": "1e-05", 
        "fix_gamma": "False"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "bn3b1_branch2c", 
      "attr": {
        "eps": "1e-05", 
        "fix_gamma": "False"
      }, 
      "inputs": [[191, 0, 0], [192, 0, 0], [193, 0, 0], [194, 0, 1], [195, 0, 1]]
    }, 
    {
      "op": "broadcast_add", 
      "name": "res3b1", 
      "inputs": [[162, 0, 0], [196, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "res3b1_relu", 
      "attr": {"act_type": "relu"}, 
      "inputs": [[197, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "res3b2_branch2a_weight", 
      "attr": {
        "kernel": "(1, 1, 1)", 
        "no_bias": "True", 
        "num_filter": "128", 
        "pad": "(0, 0, 0)", 
        "stride": "(1, 1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "res3b2_branch2a", 
      "attr": {
        "kernel": "(1, 1, 1)", 
        "no_bias": "True", 
        "num_filter": "128", 
        "pad": "(0, 0, 0)", 
        "stride": "(1, 1, 1)"
      }, 
      "inputs": [[198, 0, 0], [199, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "bn3b2_branch2a_gamma", 
      "attr": {
        "eps": "1e-05", 
        "fix_gamma": "False"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "bn3b2_branch2a_beta", 
      "attr": {
        "eps": "1e-05", 
        "fix_gamma": "False"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "bn3b2_branch2a_moving_mean", 
      "attr": {
        "__init__": "[\"zero\", {}]", 
        "eps": "1e-05", 
        "fix_gamma": "False"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "bn3b2_branch2a_moving_var", 
      "attr": {
        "__init__": "[\"one\", {}]", 
        "eps": "1e-05", 
        "fix_gamma": "False"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "bn3b2_branch2a", 
      "attr": {
        "eps": "1e-05", 
        "fix_gamma": "False"
      }, 
      "inputs": [[200, 0, 0], [201, 0, 0], [202, 0, 0], [203, 0, 1], [204, 0, 1]]
    }, 
    {
      "op": "Activation", 
      "name": "res3b2_branch2a_relu", 
      "attr": {"act_type": "relu"}, 
      "inputs": [[205, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "res3b2_branch2b_weight", 
      "attr": {
        "kernel": "(1, 3, 3)", 
        "no_bias": "True", 
        "num_filter": "128", 
        "pad": "(0, 1, 1)", 
        "stride": "(1, 1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "res3b2_branch2b", 
      "attr": {
        "kernel": "(1, 3, 3)", 
        "no_bias": "True", 
        "num_filter": "128", 
        "pad": "(0, 1, 1)", 
        "stride": "(1, 1, 1)"
      }, 
      "inputs": [[206, 0, 0], [207, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "bn3b2_branch2b_gamma", 
      "attr": {
        "eps": "1e-05", 
        "fix_gamma": "False"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "bn3b2_branch2b_beta", 
      "attr": {
        "eps": "1e-05", 
        "fix_gamma": "False"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "bn3b2_branch2b_moving_mean", 
      "attr": {
        "__init__": "[\"zero\", {}]", 
        "eps": "1e-05", 
        "fix_gamma": "False"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "bn3b2_branch2b_moving_var", 
      "attr": {
        "__init__": "[\"one\", {}]", 
        "eps": "1e-05", 
        "fix_gamma": "False"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "bn3b2_branch2b", 
      "attr": {
        "eps": "1e-05", 
        "fix_gamma": "False"
      }, 
      "inputs": [[208, 0, 0], [209, 0, 0], [210, 0, 0], [211, 0, 1], [212, 0, 1]]
    }, 
    {
      "op": "Activation", 
      "name": "res3b2_branch2b_relu", 
      "attr": {"act_type": "relu"}, 
      "inputs": [[213, 0, 0]]
    }, 
    {
      "op": "_mul_scalar", 
      "name": "_mulscalar6", 
      "attr": {"scalar": "0.5"}, 
      "inputs": [[214, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "res3b2_branch2b_t_weight", 
      "attr": {
        "kernel": "(3, 1, 1)", 
        "no_bias": "True", 
        "num_filter": "128", 
        "pad": "(1, 0, 0)", 
        "stride": "(1, 1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "res3b2_branch2b_t", 
      "attr": {
        "kernel": "(3, 1, 1)", 
        "no_bias": "True", 
        "num_filter": "128", 
        "pad": "(1, 0, 0)", 
        "stride": "(1, 1, 1)"
      }, 
      "inputs": [[214, 0, 0], [216, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "bn3b2_branch2b_t_gamma", 
      "attr": {
        "eps": "1e-05", 
        "fix_gamma": "False"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "bn3b2_branch2b_t_beta", 
      "attr": {
        "eps": "1e-05", 
        "fix_gamma": "False"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "bn3b2_branch2b_t_moving_mean", 
      "attr": {
        "__init__": "[\"zero\", {}]", 
        "eps": "1e-05", 
        "fix_gamma": "False"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "bn3b2_branch2b_t_moving_var", 
      "attr": {
        "__init__": "[\"one\", {}]", 
        "eps": "1e-05", 
        "fix_gamma": "False"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "bn3b2_branch2b_t", 
      "attr": {
        "eps": "1e-05", 
        "fix_gamma": "False"
      }, 
      "inputs": [[217, 0, 0], [218, 0, 0], [219, 0, 0], [220, 0, 1], [221, 0, 1]]
    }, 
    {
      "op": "_mul_scalar", 
      "name": "_mulscalar7", 
      "attr": {"scalar": "0.5"}, 
      "inputs": [[222, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus3", 
      "inputs": [[215, 0, 0], [223, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "res3b2_branch2b_st_relu", 
      "attr": {"act_type": "relu"}, 
      "inputs": [[224, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "res3b2_branch2c_weight", 
      "attr": {
        "kernel": "(1, 1, 1)", 
        "no_bias": "True", 
        "num_filter": "512", 
        "pad": "(0, 0, 0)", 
        "stride": "(1, 1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "res3b2_branch2c", 
      "attr": {
        "kernel": "(1, 1, 1)", 
        "no_bias": "True", 
        "num_filter": "512", 
        "pad": "(0, 0, 0)", 
        "stride": "(1, 1, 1)"
      }, 
      "inputs": [[225, 0, 0], [226, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "bn3b2_branch2c_gamma", 
      "attr": {
        "eps": "1e-05", 
        "fix_gamma": "False"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "bn3b2_branch2c_beta", 
      "attr": {
        "eps": "1e-05", 
        "fix_gamma": "False"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "bn3b2_branch2c_moving_mean", 
      "attr": {
        "__init__": "[\"zero\", {}]", 
        "eps": "1e-05", 
        "fix_gamma": "False"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "bn3b2_branch2c_moving_var", 
      "attr": {
        "__init__": "[\"one\", {}]", 
        "eps": "1e-05", 
        "fix_gamma": "False"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "bn3b2_branch2c", 
      "attr": {
        "eps": "1e-05", 
        "fix_gamma": "False"
      }, 
      "inputs": [[227, 0, 0], [228, 0, 0], [229, 0, 0], [230, 0, 1], [231, 0, 1]]
    }, 
    {
      "op": "broadcast_add", 
      "name": "res3b2", 
      "inputs": [[198, 0, 0], [232, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "res3b2_relu", 
      "attr": {"act_type": "relu"}, 
      "inputs": [[233, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "res3b3_branch2a_weight", 
      "attr": {
        "kernel": "(1, 1, 1)", 
        "no_bias": "True", 
        "num_filter": "128", 
        "pad": "(0, 0, 0)", 
        "stride": "(1, 1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "res3b3_branch2a", 
      "attr": {
        "kernel": "(1, 1, 1)", 
        "no_bias": "True", 
        "num_filter": "128", 
        "pad": "(0, 0, 0)", 
        "stride": "(1, 1, 1)"
      }, 
      "inputs": [[234, 0, 0], [235, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "bn3b3_branch2a_gamma", 
      "attr": {
        "eps": "1e-05", 
        "fix_gamma": "False"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "bn3b3_branch2a_beta", 
      "attr": {
        "eps": "1e-05", 
        "fix_gamma": "False"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "bn3b3_branch2a_moving_mean", 
      "attr": {
        "__init__": "[\"zero\", {}]", 
        "eps": "1e-05", 
        "fix_gamma": "False"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
